package com.example.srhr_client.model;

import android.os.Bundle;

import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.example.srhr_client.R;
import com.example.srhr_client.adapter.QuesAnsAdapter;

import java.util.ArrayList;
import java.util.List;

public class AppFaq extends Fragment {
    View rootView;
    //PDFView pdfView;
    RecyclerView recyclerView;
    QuesAnsAdapter quesAnsAdapter;
    List<QuesAns> quesAnsList;




    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        rootView = inflater.inflate(R.layout.fragment_app_faq, container, false);
        recyclerView = rootView.findViewById(R.id.rv_app_faq);
        quesAnsList = new ArrayList<>();

        quesAnsList.add(new QuesAns("क्या यह सच है कि पुरुष भी मेनोपॉज से गुजरते हैं? \n "," हां, पुरुषों में भी मेनोपॉज होता है। कुछ डॉक्टर इसे उम्र बढ़ने वाले पुरुष (ADAM) में एंड्रोजन (टेस्टोस्टेरोन) की कमी के रूप में संदर्भित करते हैं, जिसके कारण पुरुष आमतौर पर उम्र बढ़ने के कारण टेस्टोस्टेरोन उत्पादन में गिरावट का अनुभव करते हैं। "
                , "Q1"));
        quesAnsList.add(new QuesAns(" क्या योनि स्राव सामान्य है? \n "," हां, योनि स्राव बिल्कुल सामान्य है। हमारी योनि में एक आत्म-सफाई गुण है। यह योनि द्रव के माध्यम से सभी गन्नों को साफ करता है। हम इसे डिस्चार्ज कहते हैं। यह सामान्य कामकाजी योनि का संकेत है। \n "+
                "यदि डिस्चार्ज सामान्य से अधिक है, तो असामान्य गंध या रंग है, तो आपको डॉक्टर से बात करनी चाहिए। \n","Q2"));
        quesAnsList.add(new QuesAns("क्या एक महिला स्तनपान करते समय गर्भवती हो सकती है? \n", "हालांकि एक आम धारणा है कि एक महिला गर्भवती नहीं हो सकती है जबकि वह स्तनपान कर रही है, फिर भी वह गर्भवती हो सकती है। स्तनपान मासिक धर्म को दबा या देरी कर सकती है। इससे पहले ओव्यूलेशन होगा। मासिक धर्म का फिर से शुरू होना, इसलिए उपयोग करने के लिए उचित जन्म नियंत्रण विधि पर अपने डॉक्टर की सिफारिश का पालन करें। \n ","Q3"));
        quesAnsList.add(new QuesAns(" क्या लेटेक्स कंडोम के साथ स्नेहक के रूप में वैसलीन का उपयोग करना ठीक है?\n","नहीं। केवल कंडोम के साथ के-वाई जेली जैसे पानी आधारित स्नेहक का उपयोग करें। वैसलीन की तरह तेल-आधारित स्नेहक, कंडोम को कमजोर कर सकते हैं और इसे तोड़ने का कारण बन सकते हैं.\n","Q4"));
        quesAnsList.add(new QuesAns("क्या जन्म नियंत्रण की वापसी पद्धति का उपयोग करके एक महिला गर्भवती हो सकती है? \n" ," वापसी विधि पूरी तरह से जन्म नियंत्रण की पूरी विधि नहीं है। आप गर्भवती हो सकती हैं, यदि आदमी वास्तव में चरमोत्कर्ष से पहले स्खलन करता है (तरल पदार्थ जिसमें शुक्राणु होते हैं) योनि में छोड़ा जा सकता है।\n","Q5"));
        quesAnsList.add(new QuesAns("यौन स्वास्थ्य क्या है? \n" ,  " अच्छे स्वास्थ्य को पूर्ण शारीरिक, मानसिक और सामाजिक कल्याण की अवस्था माना जाता है, न कि केवल बीमारियों या दुर्बलता का अभाव। यौन स्वास्थ्य के सिद्धांत समान हैं: \"शारीरिक भलाई\" का अर्थ है आपके जननांगों और संबंधित प्रणालियों के लिए अच्छा स्वास्थ्य और स्वच्छता। \"मानसिक कल्याण\" का अर्थ है अपनी यौन इच्छाओं और आवश्यकताओं के बारे में ठीक महसूस करना और उनके बारे में दोषी या उदास नहीं होना। \"सामाजिक भलाई\" का अर्थ है आपकी यौन इच्छाओं और जरूरतों के कारण सामाजिक भेदभाव का सामना न करना, या असुरक्षित सेक्स से उत्पन्न किसी समस्या के कारण। इन सभी कारकों का एक संयोजन आपको (यौन) स्वस्थ के लिए बनाता है!\n","Q6"));
        quesAnsList.add(new QuesAns("एचआईवी और एड्स क्या हैं? क्या वे समान हैं? \n" , " एचआईवी मानव प्रतिरक्षा वायरस के लिए खड़ा है और एड्स का मतलब है कि प्रतिरक्षा में कमी सिंड्रोम। सरल शब्दों में: एचआईवी एक वायरस है जो मानव शरीर की प्रतिरक्षा प्रणाली को कमजोर या कमजोर बना देता है, जबकि एड्स एचआईवी संक्रमण का एक परिणाम है\n","Q7"));
        quesAnsList.add(new QuesAns("एड्स के पूर्ण रूप का क्या अर्थ है: एक्वायर्ड इम्यून डेफिशिएंसी सिंड्रोम? \n" ,  " अधिग्रहीत शब्द का अर्थ है कि एड्स जन्म से वंशानुगत या आपके शरीर में मौजूद नहीं है। यह एक बाहरी स्रोत से कुछ व्यवहार या स्थितियों के माध्यम से आता है। प्रतिरक्षा की कमी का मतलब है कि एड्स एक ऐसी चीज है जो आपकी प्रतिरक्षा में कमी करती है। सिंड्रोम का मतलब है कि एड्स बीमारियों का एक संग्रह है जो आपके शरीर पर हमला करता है जब इसकी प्रतिरक्षा कमजोर हो जाती है.\n","Q8"));
        quesAnsList.add(new QuesAns("आप एचआईवी से कैसे संक्रमित हो सकते हैं? \n" ,  " एचआईवी तब फैलता है जब किसी संक्रमित व्यक्ति के रक्त, वीर्य या गुदा या योनि के तरल पदार्थ आपके रक्तप्रवाह में मिल जाते हैं। ऐसा होने के लिए सबसे आम तरीके असुरक्षित गुदा या योनि सेक्स या एचआईवी पॉजिटिव व्यक्ति के साथ सुई या सीरिंज साझा करना है। \n " +
                "                 \"गर्भवती महिलाएं जो एचआईवी पॉजिटिव हैं, वे जन्म से पहले या जन्म के दौरान अपने बच्चे को वायरस पास कर सकती हैं। एचआईवी स्तनपान के माध्यम से भी बच्चे को पारित कर सकता है। लेकिन एचआईवी दवा लेने वाली महिलाओं के लिए जोखिम बहुत कम है।\n","Q8"));
        quesAnsList.add(new QuesAns(" आप एचआईवी से कैसे संक्रमित हो सकते हैं? \n" , " एचआईवी तब फैलता है जब किसी संक्रमित व्यक्ति के रक्त, वीर्य या गुदा या योनि के तरल पदार्थ आपके रक्तप्रवाह में मिल जाते हैं। ऐसा होने के लिए सबसे आम तरीके असुरक्षित गुदा या योनि सेक्स या एचआईवी पॉजिटिव व्यक्ति के साथ सुई या सीरिंज साझा करना है। \n "+
                "                 \"गर्भवती महिलाएं जो एचआईवी पॉजिटिव हैं, वे जन्म से पहले या जन्म के दौरान अपने बच्चे को वायरस पास कर सकती हैं। एचआईवी स्तनपान के माध्यम से भी बच्चे को पारित कर सकता है। लेकिन एचआईवी दवा लेने वाली महिलाओं के लिए जोखिम बहुत कम है।\n","Q9"));
        quesAnsList.add(new QuesAns("  आप सेक्स के माध्यम से एचआईवी से संक्रमित होने से कैसे बच सकते हैं? \n" , " एक अविवाहित साथी के साथ पारस्परिक रूप से वफादार और एकरूप यौन संबंध रखने से। \n " +
                "                 \"या हर यौन साथी के साथ सुरक्षित सेक्स का अभ्यास करना, जिसमें कंडोम या अन्य लेटेक्स बाधाओं (जैसे दंत बांधों और मादाओं) का सही तरीके से उपयोग करना शामिल है और हर बार जब आप कुछ भेदक यौन क्रियाओं का अभ्यास करते हैं।\n","Q10"));
        quesAnsList.add(new QuesAns("यौन स्वास्थ्य के संदर्भ में पुरुष जिम्मेदारी क्या है? \n" ,  " यौन स्वास्थ्य के संदर्भ में पुरुष जिम्मेदारी क्या है?\n","Q11"));
        quesAnsList.add(new QuesAns("क्या भारत में गर्भपात कानूनी है? \n" ,  "हाँ, भारत में गर्भपात कानूनी है। कोई भी जो 20 सप्ताह से कम की गर्भावस्था के साथ 18 या उससे अधिक की उम्र का है, गर्भपात कराने के लिए निकटतम लाइसेंस प्राप्त क्लिनिक में जा सकता है\n","Q12"));
        quesAnsList.add(new QuesAns("क्या मुझे गर्भपात कराने के लिए किसी की अनुमति की आवश्यकता है? \n"," यदि आप एक वयस्क हैं, तो आपको गर्भपात कराने के लिए किसी की अनुमति की आवश्यकता नहीं है। यह आपका शरीर है, इसलिए यह आपकी पसंद है \"","Q13"));
        quesAnsList.add(new QuesAns("क्या मैं सिर्फ डॉक्टर के पास जाने के बजाय फार्मेसी से गर्भपात की गोली ले सकता हूं? \n " , " नहीं, डॉक्टर से बात करना बहुत महत्वपूर्ण है क्योंकि बिना देखरेख के गोलियां लेना जीवन के लिए खतरा पैदा कर सकता है। अपने चिकित्सक से बात करें, जो आपका मार्गदर्शन करेगा और आपको सर्वोत्तम संभव देखभाल देगा। इसके अलावा, फार्मासिस्ट के लिए आपको डॉक्टर के पर्चे के बिना गोलियां बेचना अवैध है\n","Q14"));
        quesAnsList.add(new QuesAns(" क्या यह सच है कि पीरियड के दर्द / ऐंठन के लिए दर्द निवारक दवा लेने से मुझे बांझ बना दिया जाएगा? \n" ,  " क्या यह सच है कि पीरियड के दर्द / ऐंठन के लिए पेनकिलर लेना मुझे बांझ कर देगा?\n","Q15"));
        quesAnsList.add(new QuesAns(" यौन अधिकार क्या है? \n" , " यौन संबंध बनाना यौन अधिकार नहीं है। एक यौन कार्य में सबसे महत्वपूर्ण कारक दोनों भागीदारों की इच्छा और सहमति है। यह एक ही सेक्स पार्टनर या पुरुष और महिला पार्टनर का सच हो सकता है। हमारा समाज विवाह को यौन संबंध बनाने के लिए एक लाइसेंस के रूप में देखता है और यौन संबंधों की अस्वीकृति करता है जो भागीदारों की आपसी और लंबी स्थायी या यादृच्छिक पसंद हो सकती है। आपको रिश्ते की प्रकृति के बारे में समझने और जानने की आवश्यकता है जो आकस्मिक हो सकता है या कीमत के लिए हो सकता है। \"सहमति\" के सवाल पर कोई समझौता नहीं है। नैतिक और नैतिक मूल्य आपके अपने हैं और आमतौर पर आपके धर्म और संस्कृति से प्रभावित होते हैं। महिला / लड़की को इस बात से अवगत होना चाहिए कि गर्भाधान (पुरुष के शुक्राणु अपने आप महिला के अंडे से जुड़ जाते हैं) सेक्स के बहुत पहले कार्य में हो सकते हैं, जो युवा महिलाओं में सबसे अधिक बार होता है, जो हर महीने अंडे के स्वस्थ और नियमित रूप से रिलीज होते हैं जो बंद हो जाएंगे मिनट गर्भाधान होता है। जिम्मेदारी का प्रश्न दोनों भागीदारों का होना चाहिए जो स्वेच्छा से एक बच्चे को याद रखना चाहते हैं कि पुरुष के पास कोई जिम्मेदारी नहीं है यदि कोई महिला आकस्मिक संबंध में गर्भवती हो जाती है। \n "+
                "                \"सेक्स करने का अधिकार के रूप में स्वतंत्रता: \n" +
                "                \"20 वीं सदी में महिलाओं के आंदोलन ने सेक्स करने के अधिकार के रूप में स्वतंत्रता की समझ में एक बड़ा बदलाव लाया, जो गैर-जिम्मेदाराना सेक्स की कीमत पर एक महिला की स्वतंत्रता का दावा करने का सबसे अच्छा तरीका नहीं है, जिसके परिणामस्वरूप गर्भावस्था हो सकती है और यौन संचारित रोग। \n " +
                "                \"किसी पुरुष या महिला के व्यक्तिगत अधिकार की अवधारणा, आनंद के लिए सेक्स करना, प्रजनन के लिए सेक्स से अलग है जैसा कि धर्म द्वारा निर्धारित किया गया है जो संयम का अभ्यास करने में परिलक्षित होता है। सेक्स एक जैविक आवश्यकता है और इसलिए हम इसे प्राकृतिक और यौन कह सकते हैं। इच्छा कुछ शर्म की बात नहीं है। हालांकि, यह पूरी तरह से उपभोग बन सकता है और अगर संतुष्टि से नहीं मिला तो जीवन में अन्य सभी जरूरतों से ध्यान भटक सकता है। \\ n \"+\n" +
                "                \"पुरुष और महिलाएं अलग-अलग यौन इच्छा का अनुभव करते हैं। हमें किशोरों और युवाओं की ज़रूरतों को समझना होगा जब हार्मोन सबसे अधिक मांग और रिलीज की मांग करते हैं। यौन इच्छा और आकर्षण अक्सर प्यार से भ्रमित होते हैं। इसलिए, प्यार में पड़ने की आवश्यकता जैविक से परे है।\" जब भावनाएँ शामिल होती हैं और हम कहते हैं कि \"लव ब्लाइंड है\"। \n " +
                "                \"प्रत्येक व्यक्तिगत अनुभव अद्वितीय है और हम प्यार को सही ठहराने के कारणों की तलाश नहीं करते हैं।\n","Q16"));

        quesAnsList.add(new QuesAns("एक महिला को क्या करना चाहिए अगर वह अपनी जन्म नियंत्रण की गोलियाँ लेना भूल जाती है? \n" , " यदि आप जन्म नियंत्रण की गोली लेना भूल जाती हैं, तो जैसे ही आपको याद हो, इसे लें। यदि आपको अगले दिन तक याद नहीं है, तो उस दिन दो गोलियां लेकर आगे बढ़ें। यदि आप दो दिनों के लिए अपनी गोलियां लेना भूल जाते हैं, तो दिन में दो गोलियां याद रखें और अगले दिन दो गोलियां लें। फिर आप समय पर वापस आ जाएंगे। यदि आप दो से अधिक गोलियां याद करते हैं, तो निर्देशों के लिए अपने स्वास्थ्य देखभाल प्रदाता को कॉल करें। उन निर्देशों को रविवार तक रोजाना एक गोली ले सकते हैं और फिर एक नया पैक शुरू कर सकते हैं या बाकी गोली पैक को छोड़ सकते हैं और उसी दिन एक नया पैक शुरू कर सकते हैं। \\ n \"+\n" +
                "                \"जब भी आप एक गोली लेना भूल जाते हैं, तो आपको गोली पैक खत्म करने तक एक और जन्म नियंत्रण का उपयोग करना चाहिए। जब \u200B\u200Bआप एक जन्म नियंत्रण गोली लेना भूल जाते हैं, तो आप अपने अंडाशय से एक अंडा जारी करने की संभावना बढ़ाते हैं। हालांकि, यदि आप 28-दिवसीय गोलियों में से अंतिम सात में से कोई भी लेना भूल जाते हैं, तो आप अपनी गर्भावस्था की संभावना नहीं बढ़ाएंगी, क्योंकि इन गोलियों में केवल निष्क्रिय तत्व होते हैं। यदि आप अपनी अवधि को याद करती हैं और एक या अधिक गोलियां लेना भूल जाती हैं, तो गर्भावस्था परीक्षण\n","Q17"));


        recyclerView.setLayoutManager(new LinearLayoutManager(getContext()));
        quesAnsAdapter = new QuesAnsAdapter(quesAnsList);
        recyclerView.setAdapter(quesAnsAdapter);
        return rootView;
    }
}